tests/load/api-load-test.yml
config:
  target: '{{ $processEnvironment.API_BASE_URL || "http://localhost:3000" }}'
  phases:
    - duration: 10
      arrivalRate: 1
      name: 'Basic smoke test'
  defaults:
    headers:
      'Content-Type': 'application/json'
      'User-Agent': 'Artillery Load Test (SANDBOX ONLY)'
      'X-Test-Mode': 'true'
  processor: './load-test-helpers.js'

# SAFETY CHECK: Only run against localhost or explicitly sandbox environments
before:
  flow:
    - log: '🔒 SAFETY CHECK: Ensuring load test only runs against safe targets'

scenarios:
  - name: 'Health Check'
    weight: 60
    flow:
      - get:
          url: '/api/health'
          expect:
            - statusCode: 200
            - hasProperty: 'status'

  - name: 'Get Service Availability'
    weight: 40
    flow:
      - get:
          url: '/api/service-availability'
          qs:
            serviceId: 'haircut'
            date: '2025-12-31'
          expect:
            - statusCode: [200, 400]

# Simple smoke test thresholds
expect:
  thresholds:
    - http.response_time.p95: 5000 # 95th percentile response time < 5s
    - http.codes.200: 50 # At least 50% success rate
    - http.codes.5xx: 0 # No server errors