tests/load/production-validation.yml
config:
  target: '{{ $processEnvironment.API_BASE_URL }}'
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Production validation'
  defaults:
    headers:
      'Content-Type': 'application/json'
      'User-Agent': 'Artillery Production Validation'

scenarios:
  - name: 'Critical Health Check'
    weight: 50
    flow:
      - get:
          url: '/api/health'
          expect:
            - statusCode: 200
            - hasProperty: 'status'
            - equals:
                - '{{ status }}'
                - 'healthy'

  - name: 'Service Availability Validation'
    weight: 30
    flow:
      - get:
          url: '/api/service-availability'
          qs:
            serviceId: 'haircut'
            date: '2024-12-31'
          expect:
            - statusCode: [200, 400]

  - name: 'Customer Endpoint Validation'
    weight: 20
    flow:
      - get:
          url: '/api/customer/validation-test'
          expect:
            - statusCode: [200, 404]

# Strict production thresholds
expect:
  thresholds:
    - http.response_time.p95: 1000 # Stricter: 95th percentile < 1s
    - http.response_time.p99: 2000 # Stricter: 99th percentile < 2s
    - http.codes.200: 90 # Higher success rate required
    - http.codes.5xx: 0 # Absolutely no server errors